G = int(input("รับค่าน้ำหนัก: "))
H = int(input("รับค่าส่วนสูง: "))
BMI = G/ (H/100)**2
print("BMI = %.2f" % BMI)
if BMI < 18.50:
    print("น้ำหนักน้อย/ผอม")
    print("ภาวะเสี่ยงต่อโรค: มากกว่าปกติ")
elif BMI >= 18.50 and BMI <= 22.90:
    print("ปกติ(สุขภาพดี)")
    print("ภาวะเสี่ยงต่อโรค: เท่าคนปกติ")
elif BMI >= 23 and BMI <= 24.90:
    print("ท้วม/โรคอ้วนระดับ1")
    print("ภาวะเสี่ยงต่อโรค: อันตรายอันดับ1")
elif BMI >= 25 and BMI <= 29.90:
    print("อ้วน/โรคอ้วนระดับ2")
    print("ภาวะเสี่ยงต่อโรค: อันตรายอันดับ2")
elif BMI >= 30:
    print("อ้วนมาก/โรคอ้วนระดับ3")
    print("ภาวะเสี่ยงต่อโรค: อันตรายอันดับ3")